Les acteurs ont en moyenne quel âge ? données films et acteurs (champs age, birth year et start year)
age moyen à date du film

trier les acteurs = str.contains (actor actress) et explode pour prendre que les acteurs
Prendre que ceux nés après 1800

idem pour les knownForTitles

colonne âge de l'acteur

In [82]:
import pandas as pd
from datetime import datetime
from datetime import timedelta
import numpy as np
import plotly.express as px 
import plotly.graph_objects as go 
import matplotlib.pyplot as plt
import seaborn as sns

In [83]:
# appel de la table acteurs

actors = pd.read_csv('https://datasets.imdbws.com/name.basics.tsv.gz', sep = '\t', low_memory=False)

In [84]:
# tri des acteurs par date de naissance puis date de décès

actors.sort_values(by=['birthYear','deathYear'], inplace=True)

In [85]:
#rest index 

actors.reset_index(inplace=True)

In [86]:
actors.head()

,index,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,739770,nm0784172,Lucio Anneo Seneca,0004,0065,writer,"tt0049203,tt0237666,tt0218822,tt0972562"
1,6783714,nm4511421,Megan Liz Smith,0012,\N,"miscellaneous,actress","tt3416744,tt1966378,tt10183848"
2,10356392,nm8810146,Paul Walsh,0021,\N,actor,"tt0314567,tt0093223,tt0098878"
3,407676,nm0430769,Flavius Josephus,0037,0095,"writer,miscellaneous","tt0049833,tt0237666,tt0009573,tt0273236"
4,3902529,nm1306202,Plutarch,0046,0122,writer,"tt0272979,tt0237666,tt0472473,tt0056937"

In [87]:
#drop colonne index en double 
actors.drop('index',axis = 1, inplace=True)

In [88]:
#type de données des colonnes : object, je veux du datetime ou du int

actors.info('birthYear')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11362755 entries, 0 to 11362754
Data columns (total 6 columns):
 #   Column             Dtype
---  ------             -----
 0   nconst             object
 1   primaryName        object
 2   birthYear          object
 3   deathYear          object
 4   primaryProfession  object
 5   knownForTitles     object
dtypes: object(6)
memory usage: 520.1+ MB

In [89]:
# Recherches de acteurs sans date de naissance indiquée

actors_without_birthYear = actors.loc[actors['birthYear'] =='\\N']
print(actors_without_birthYear)

             nconst         primaryName birthYear deathYear  \
537229    nm0653992                Ovid        \N      0017
537230    nm1359896       Philo Judaeus        \N      0050
537231    nm0678112           Petronius        \N      0066
537232    nm1504864             Juvenal        \N      0140
537233    nm3847263    Jacob Tsurtaveli        \N      0485
...             ...                 ...       ...       ...
11362750  nm9993714   Romeo del Rosario        \N        \N
11362751  nm9993716       Essias Loberg        \N        \N
11362752  nm9993717  Harikrishnan Rajan        \N        \N
11362753  nm9993718         Aayush Nair        \N        \N
11362754  nm9993719          Andre Hill        \N        \N

                            primaryProfession  \
537229                                 writer
537230                          miscellaneous
537231                                 writer
537232                                 writer
537233                                 writer
...                                       ...
11362750  animation_department,art_department
11362751                                  NaN
11362752                      cinematographer
11362753                      cinematographer
11362754                                  NaN

                                   knownForTitles
537229    tt0085182,tt3179572,tt3907210,tt0057818
537230                                  tt0049833
537231    tt9064588,tt0166788,tt0064940,tt0058904
537232                                  tt0401443
537233                                  tt1615444
...                                           ...
11362750                     tt2455546,tt11657662
11362751                                       \N
11362752                                tt8736744
11362753                                       \N
11362754                                       \N

[10825526 rows x 6 columns]

In [90]:
actors['birthYear'].replace('\\N', np.nan, inplace=True)

In [91]:
# suppression des lignes Nan rapport à la date de naissance

#actors.dropna(subset=['birthYear'], inplace=True)

In [92]:
actors.shape

(11362755, 6)

In [98]:
actors.head()

,nconst,primaryName,birthYear,deathYear,primaryProfession,knownForTitles
0,nm0784172,Lucio Anneo Seneca,0004,0065,writer,"tt0049203,tt0237666,tt0218822,tt0972562"
1,nm4511421,Megan Liz Smith,0012,\N,"miscellaneous,actress","tt3416744,tt1966378,tt10183848"
2,nm8810146,Paul Walsh,0021,\N,actor,"tt0314567,tt0093223,tt0098878"
3,nm0430769,Flavius Josephus,0037,0095,"writer,miscellaneous","tt0049833,tt0237666,tt0009573,tt0273236"
4,nm1306202,Plutarch,0046,0122,writer,"tt0272979,tt0237666,tt0472473,tt0056937"

In [93]:
# actors['birthYear']= actors['birthYear'].astype(int)

In [94]:
# prendre que la colonne birth
#actors_birth = actors['birthYear'] 
#print(actors_birth)

In [95]:
'''actors_birth2 = actors_birth(['actors_birth'] >= 1850)
print(actors_birth2)

#actors['birthYear'] = datetime.strptime(actors['birthYear'], '%Y')'''

"actors_birth2 = actors_birth(['actors_birth'] >= 1850)\nprint(actors_birth2)\n\n#actors['birthYear'] = datetime.strptime(actors['birthYear'], '%Y')"

In [96]:
#transformer les date en int

In [97]:
#actors.loc[actors['birthYear'] == ' ']